{
  "0": "This document describes a town serving as a refuel station, strategically located both before and after Timora Pass.",
  "commanderBrief.md": "This commander's briefing details Operation Checkmate, an SAS-led mission in Reshman Province aimed at collapsing the Taliban's command, control, and logistics capabilities. It outlines strategic intent, intelligence-driven tactics, and coordination efforts to achieve precision strikes, minimize collateral damage, and preserve local cooperation.",
  "hvi_targets.md": "This document is a High-Value Targets (HVT) dossier, detailing hostile leaders and specialists, as well as local intelligence assets, including their roles, locations, threat levels, and operational objectives.",
  "iedBrief.md": "This tactical brief details the Improvised Explosive Device (IED) threat in Reshman Province, covering insurgent tactics, emplacement indicators, and immediate actions for encounters. It provides guidance on patrol mitigation, force protection, reporting, and coordination with support elements, emphasizing a defensive operational approach.",
  "key_leader_engagements.md": "This document summarizes three key leader engagements (KLEs), noting both opportunities for local cooperation via civil aid and a heightened threat environment due to confirmed surveillance and an ambush during one engagement.",
  "timora_pass_movement.md": "The Timora Pass sees consistent logistical movements at dawn and dusk, potentially aligned with prayer times. There are no significant built-up checkpoints, except for defenses around a gas pump.",
  "usmc_sse_TAI2001_farm.md": "USMC SSE discovered a laptop containing an Igla weapon request from a KIA individual (Mohammdi Rahman) to Hafiz Rahman, an operational logistics leader for Timora Pass. Capture of Hafiz Rahman is requested for interrogation concerning potential out-of-country contacts.",
  "campaign_overview.md": "The document 'campaign_overview.md' is empty and cannot be summarized.",
  "key_locations.md": "The document 'key_locations.md' is empty and cannot be summarized.",
  "timora_pass_recon.md": "The document 'timora_pass_recon.md' is empty and cannot be summarized.",
  "itimad_farm.md": "The document 'itimad_farm.md' is empty and cannot be summarized.",
  "Timora_Pass_South.md": "The document 'Timora_Pass_South.md' is empty and cannot be summarized.",
  "Wadiah_Timora_Pass.md": "The document 'Wadiah_Timora_Pass.md' is empty and cannot be summarized.",
  "Hadassah_Gas_Station.md": "The document 'Hadassah_Gas_Station.md' is empty and cannot be summarized.",
  "kezban.md": "The document 'kezban.md' is empty and cannot be summarized.",
  "tai2001_rooftop.md": "The document 'tai2001_rooftop.md' is empty and cannot be summarized.",
  "spotter_codes.md": "The document 'spotter_codes.md' is empty and cannot be summarized.",
  "Operation Checkmate debrief.txt": "The document 'Operation Checkmate debrief.txt' is empty and cannot be summarized."
}